In [1]:
import pandas as pd
pd.__version__

'1.1.3'

In [2]:
import os
os.getcwd()

'/Users/brigettethompson/Desktop/BIP-PYTHON/sales_analysis/notebooks'

In [3]:
import pandas as pd

contracts = pd.read_csv (r'/Users/brigettethompson/Desktop/BIP-PYTHON/sales_analysis/data/contracts.csv')
print (contracts)

     contract_id  customer_id contract_start  contract_term     deposit  \
0              1          127      8/17/2019             12  $53,000.00
1              2          119      12/1/2019             22  $77,000.00
2              3          160       5/1/2019             15  $13,000.00
3              4            7      12/8/2019             23  $56,000.00
4              5          144      2/11/2019              7  $21,000.00
..           ...          ...            ...            ...         ...
995          996           57      11/8/2019             15  $38,000.00
996          997          126      1/13/2019             20  $28,000.00
997          998           89       5/8/2019              7  $73,000.00
998          999           52      3/26/2019              7  $63,000.00
999         1000            3      3/19/2019             16  $23,000.00

    monthly_amt
0    $11,600.00
1    $14,600.00
2    $22,800.00
3    $11,400.00
4    $19,800.00
..          ...
995   $5,300.00
996  $16,000.00
997  $18,400.00
998  $21,600.00
999  $15,700.00

[1000 rows x 6 columns]

In [4]:
import pandas as pd

customers = pd.read_csv (r'/Users/brigettethompson/Desktop/BIP-PYTHON/sales_analysis/data/customers.csv')
print (customers)

      id       company            sector  \
0      1     Bubblebox     Capital Goods
1      2          Izio            Energy
2      3  Twitterworks               NaN
3      4          Viva       Health Care
4      5   Jabberstorm        Technology
..   ...           ...               ...
245  246      Livefish            Energy
246  247          Katz               NaN
247  248         Yombu  Public Utilities
248  249       Dynazzy               NaN
249  250   Twitterwire        Technology

                                    industry                      email  \
0              Military/Government/Technical   kyerson0@bizjournals.com
1                       Oil & Gas Production        farlet1@comcast.net
2                                        NaN         alerohan2@ox.ac.uk
3                      Major Pharmaceuticals   wgiovanitti3@nytimes.com
4    Computer Software: Prepackaged Software          pscallon4@fc2.com
..                                       ...                        ...
245              Oilfield Services/Equipment      gcressy6t@twitter.com
246                                      NaN        siacobini6u@fc2.com
247                 Natural Gas Distribution        ccandy6v@tumblr.com
248                                      NaN   lmothersole6w@nsw.gov.au
249                           Semiconductors  haseef6x@miitbeian.gov.cn

                        address            city state    zip
0               76 Randy Circle       San Diego    CA  92170
1    15360 Village Green Street         Spokane    WA  99252
2                 29 Hovde Hill       Milwaukee    WI  53234
3              074 Center Place          Topeka    KS  66667
4                   4 Moose Way     Terre Haute    IN  47805
..                          ...             ...   ...    ...
245        05019 Eastwood Alley     Brooksville    FL  34605
246       6567 Old Shore Center           Omaha    NE  68134
247          6442 Vahlen Avenue  Salt Lake City    UT  84125
248           15 Oakridge Court   New York City    NY  10060
249             8190 Rusk Point         Seattle    WA  98166

[250 rows x 9 columns]

In [5]:
contracts_1 = pd.DataFrame(contracts, columns = ['customer_id', 'deposit', 'contract_term', 'monthly_amt'])
print (contracts_1)

     customer_id     deposit  contract_term monthly_amt
0            127  $53,000.00             12  $11,600.00
1            119  $77,000.00             22  $14,600.00
2            160  $13,000.00             15  $22,800.00
3              7  $56,000.00             23  $11,400.00
4            144  $21,000.00              7  $19,800.00
..           ...         ...            ...         ...
995           57  $38,000.00             15   $5,300.00
996          126  $28,000.00             20  $16,000.00
997           89  $73,000.00              7  $18,400.00
998           52  $63,000.00              7  $21,600.00
999            3  $23,000.00             16  $15,700.00

[1000 rows x 4 columns]

In [6]:
customers_1 = pd.DataFrame(customers, columns = ['id', 'state'])

customers_1.columns = ['customer_id', 'state']
customers_1.set_index('customer_id', inplace=True)
customers_1

            state
customer_id
1              CA
2              WA
3              WI
4              KS
5              IN
...           ...
246            FL
247            NE
248            UT
249            NY
250            WA

[250 rows x 1 columns]

In [7]:
combined_df = contracts_1.join(customers_1, how='inner') 
combined_df.set_index('customer_id', inplace=True)
combined_df

                deposit  contract_term monthly_amt state
customer_id
119          $77,000.00             22  $14,600.00    CA
160          $13,000.00             15  $22,800.00    WA
7            $56,000.00             23  $11,400.00    WI
144          $21,000.00              7  $19,800.00    KS
75           $74,000.00              9  $13,500.00    IN
...                 ...            ...         ...   ...
168          $77,000.00             20  $12,900.00    FL
128          $19,000.00              1   $6,300.00    NE
77           $90,000.00              9   $9,400.00    UT
66           $68,000.00             14  $13,600.00    NY
121          $99,000.00             23  $18,000.00    WA

[250 rows x 4 columns]